       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST.
       


       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       PROCEDURE DIVISION.
       0100-START-HERE.
           DISPLAY "Hello World".
       STOP RUN.
       END PROGRAM TEST.
       